const orignal = [
    {
      "page_id": 1,
      "sort_id": 0,
      "title": "트레이너 명함/서클 명함이란",
      "description": "「トレーナー名刺」を作成すると、ゲーム内の状況をまとめた画像を端末に保存できます。\r\n「サークル名刺」を作成すると、サークルランキングとサークル情報をまとめた画像を端末に保存できます。\r\n※サークルリーダーのみ、名刺の編集を行えます。\r\nまた、作成した名刺をSNSへ投稿できます。\r\n\r\n■トレーナー名刺の作成方法\r\n1. ホーム画面右上の[メニュー]を選択します。\r\n2. [プロフィール/トレーナー名刺]を選択します。\r\n3. プロフィール画面の[トレーナー名刺]を選択すると、トレーナー名刺画面に移動します。\r\n4. トレーナー名刺画面の[名刺編集]を選択し、名刺編集画面を開きます。\r\n5. ベースデザイン、イラスト、トレーナー情報を編集し[保存]を選択すると、トレーナー名刺が保存できます。\r\n\r\n■サークル名刺の作成方法\r\n1. ホーム画面の[サークル]を選択します。\r\n2. [サークルメニュー]を選択します。\r\n3. [サークル名刺]を選択すると、サークル名刺画面に移動します。\r\n4. サークル名刺画面の[名刺編集]を選択し、名刺編集画面を開きます。\r\n5. ベースデザイン、イラスト、サークル情報を編集し[保存]を選択すると、サークル名刺が保存できます。\r\n\r\n保存された名刺のイラストは、使用する端末を変更した場合も引き継がれます。\r\n※引き継いだイラストは、再編集できません。\r\n\r\n■設定中の名刺の拡大表示\r\nトレーナー名刺、サークル名刺画面にある名刺画像を選択すると、設定中の名刺画像を拡大表示できます。\r\n※Google Play Games (ベータ)版では拡大表示ができません。\r\n\r\n■SNSへの共有、端末への保存方法\r\nトレーナー名刺、サークル名刺画面の[SNS共有]を選択すると、作成した名刺画像にコメントを添えてSNSへ共有できます。\r\n※Google Play Games (ベータ)版ではSNS共有ができません。\r\n\r\nまた、トレーナー名刺、サークル名刺画面の[端末に保存]を選択すると、作成した名刺をご利用の端末に保存できます。\r\n※Google Play Games (ベータ)版では名刺の保存ができません。"
    },
    {
      "page_id": 2,
      "sort_id": 0,
      "title": "트레이너 명함 편집",
      "description": "トレーナー名刺の編集画面では、以下の内容が編集できます。\r\n\r\n■裏面に因子情報を表示する\r\n上記項目をONにすると、名刺画像に代表ウマ娘が所持している因子情報を表示できます。\r\nまた、ONになっている場合に限り、名刺編集画面で[裏面]を選択すると、裏面の内容が確認できます。\r\n\r\n■ベースデザインの編集\r\nトレーナー名刺のベースデザインに関係する項目を編集できます。\r\n・イラスト配置\r\nイラストを表示する領域を左右どちらにするか選択できます。\r\n\r\n・テーマカラー\r\nトレーナー名刺に使用するテーマカラーを選択できます。\r\n\r\n・名刺背景\r\nトレーナー名刺の背景を選択できます。\r\n\r\n■イラストの編集\r\n名刺に掲載するイラストを選択して、編集できます。\r\nイラストに選択できるのは、下記の3つです。\r\n・育成ウマ娘\r\n・サポートカード\r\n・フォト\r\n\r\n■トレーナー情報\r\n名刺に掲載するトレーナー情報を編集できます。\r\n・称号\r\n所持している称号から1つを選択して表示できます。\r\nプロフィールで設定しているものと同じ称号が表示されます。\r\n※トレーナー名刺で称号を変更した場合、プロフィールの称号も変更されます。\r\n\r\n・代表ウマ娘/育成サポート\r\n代表ウマ娘と育成サポートの設定が可能です。\r\nプロフィールで設定しているものと同じ代表ウマ娘、育成サポートが表示されます。\r\n※トレーナー名刺で代表ウマ娘、育成サポートを変更した場合、プロフィールの代表ウマ娘、育成サポートも変更されます。\r\n\r\n■コメント\r\n名刺に掲載するコメントを編集できます。\r\nコメントは最大57文字まで入力できます。\r\n※コメントを編集する際に入力された改行は反映されません。\r\n\r\n[元に戻す]を選択すると、すべての内容が編集開始時の状態に戻ります。\r\n各内容を編集後、[保存]を選択すると、編集した内容がトレーナー名刺画面に反映されます。\r\n\r\n■トレーナーIDの表示\r\n上記項目をOFFにすると、トレーナー名刺にトレーナーIDが表示されなくなります。"
    },
    {
      "page_id": 3,
      "sort_id": 0,
      "title": "서클 명함 편집",
      "description": "サークル名刺の編集画面では、以下の内容が編集できます。\r\n※サークルリーダーのみ、サークル名刺を編集できます。\r\n\r\n■ベースデザインの編集\r\nサークル名刺のベースデザインに関係する項目を編集できます。\r\n・イラスト配置\r\nイラストを表示する領域を左右どちらにするか選択できます。\r\n\r\n・テーマカラー\r\nサークル名刺に使用するテーマカラーを選択できます。\r\n\r\n・名刺背景\r\nサークル名刺の背景を選択できます。\r\n\r\n■イラストの編集\r\n名刺に掲載するイラストを選択して、編集できます。\r\nイラストに選択できるのは、下記の3つです。\r\n・育成ウマ娘\r\n・サポートカード\r\n・フォト\r\n\r\n■サークル情報\r\n名刺に掲載するサークル情報を編集できます。\r\n※サークル名刺でサークル名、加入方針、活動方針、紹介文を変更した場合、サークルのサークル名、加入方針、活動方針、紹介文も変更されます。\r\n\r\n■コメント\r\n名刺に掲載するコメントを編集できます。\r\nコメントは最大40文字まで入力できます。\r\n※コメントを編集する際に入力された改行は反映されません。\r\n\r\n[元に戻す]を選択すると、すべての内容が編集開始時の状態に戻ります。\r\n各内容を編集後、[保存]を選択すると、編集した内容がサークル名刺画面に反映されます。"
    },
    {
      "page_id": 4,
      "sort_id": 0,
      "title": "일러스트 편집(육성 우마무스메)",
      "description": "イラストの編集で[育成ウマ娘]を選択した場合、所持している育成ウマ娘と、背景を指定して表示できます。\r\n\r\n■イラスト編集で「育成ウマ娘」を選択した際にできること\r\n・[育成ウマ娘]の選択\r\n表示させたい育成ウマ娘を、リストから選択できます。\r\n\r\n・衣装の選択\r\n選択中の育成ウマ娘が所持している衣装を、リストから選択できます。\r\n\r\n・背景の選択\r\n選択した育成ウマ娘の背景に表示させる内容をリストから選択できます。"
    },
    {
      "page_id": 5,
      "sort_id": 0,
      "title": "일러스트 편집(서포트 카드, 포토)",
      "description": "イラストの編集で[サポートカード]を選択した場合、所持しているサポートカードから1枚選択できます。\r\n選択したサポートカードを編集し、名刺に表示できます。\r\n\r\nイラストの編集で[フォト]を選択した場合、撮影したフォトから1枚選択できます。\r\n選択したフォトを編集し、名刺に表示できます。\r\n\r\n■イラスト編集で[サポートカード][フォト]を選択した際にできること\r\n・「サポートカード」「フォト」の編集\r\n所持しているサポートカードやフォトを1枚選択して、編集できます。\r\n\r\n・サポートカード、フォトの拡大縮小、中央位置の調整\r\n画面上部に表示されたサポートカード、フォトの脇にある[編集]を選択すると、選択中の画像が編集状態となります。\r\n編集状態の操作方法は、Google Play版とGoogle Play Games (ベータ)版で異なります。\r\n\r\nGoogle Play版では、下記の編集ができます。\r\n・ピンチイン、ピンチアウトして拡大、縮小させる\r\n・2箇所を選択して回転させる\r\n・ドラッグして中央位置の調整をする\r\n\r\n編集状態の際にのみ表示される[移動][拡縮][回転]をONまたはOFFにすると操作の制限ができます。\r\n※ONの操作のみを行えます。\r\n※[回転]は、デフォルトがOFFです。\r\n\r\nGoogle Play Games (ベータ)版では、編集状態になると、選択中の画像の周辺に四角い枠が表示されます。\r\n四角い枠の頂点や辺にある[回転][拡縮]を選択すると、イラストの拡大、回転ができます。\r\n画像中央をドラッグすることで中央位置の調整ができます。\r\n\r\n操作した内容を元に戻したい場合は、[リセット]を選択してください。"
    }
  ];

const newlist = [
    {
        "page_id": 1,
        "description": "[소지품/변환]에서는 소지한 소비 아이템, 강화 아이템, 티켓 등을 확인할 수 있습니다.\n또한 일부 강화 아이템을 머니로 교환할 수 있습니다.\n\u203b한 번 교환한 아이템은 되돌릴 수 없습니다.\n\n■소지 중인 아이템 확인 방법\n1. 홈의 [메뉴]를 탭합니다.\n2. [소지품/변환]을 탭합니다.\n\n■소비 아이템\nTP나 RP를 회복하는 아이템, 육성이나 각종 레이스에서 사용하는 아이템 등을 확인할 수 있습니다.\n\n■강화 아이템\n육성 우마무스메를 강화할 때 사용하는 아이템을 확인할 수 있습니다.\n서포트 Pt나 각 피스도 확인할 수 있습니다.\n\n■티켓\n각종 뽑기 티켓, 육성 우마무스메나 서포트 카드로 교환할 수 있는 티켓을 확인할 수 있습니다.\n\n■기타\n각종 편자나 클로버, 여신상 등을 확인할 수 있습니다.",
        "title": "소지품/변환",
        "sort_id": 0
    },
    {
        "page_id": 2,
        "description": "[프로필/트레이너 명함]에서는 트레이너 정보를 확인하고 편집할 수 있습니다.\n\n■ 프로필의 확인 방법\n1. 홈의 [메뉴]를 탭합니다.\n2. [프로필/트레이너 명함]을 탭합니다.\n\n■ 팀 평가점\n팀 평가점을 확인할 수 있습니다.\n\n■ 트레이너명\n트레이너명을 변경할 수 있습니다.\n트레이너명은 1글자 이상 10글자 이내로 입력할 수 있습니다.\n\u203b 개인 정보 또는 사회적 규범을 위반하는 내용은 입력하지 말아주세요.\n\n■ 트레이너의 성별\n트레이너의 성별을 변경할 수 있습니다.\n성별에 맞게 일부의 대사가 바뀝니다.\n\n■ 생일\n트레이너의 생년월일을 설정할 수 있습니다.\n생일날로부터 7일간, 우마무스메들로부터 축하 메시지를 들을 수 있습니다.\n\u203b 원하는 날짜를 생일로 등록할 수 있습니다.\n\u203b 생일은 나중에 변경할 수 없습니다.\n\n■ 칭호\n칭호를 변경할 수 있습니다.\n기본적으로 [신입 트레이너]가 설정되어 있습니다.\n또한, 칭호의 획득 조건도 확인할 수 있습니다.\n\n■ 트레이너 ID\n팔로우 ID 검색이나 계정 연동에 사용하는 트레이너 ID를 확인 할 수 있습니다.\n\n■ 소속 서클\n소속된 서클을 확인할 수 있습니다.\n\n■ 도감 Lv\n도감 Lv을 확인할 수 있습니다.\n\n■ 진행 상황\n게임 내의 진행 상황을 확인할 수 있습니다.\n\n■ 코멘트\n코멘트를 변경할 수 있습니다.\n코멘트는 1글자 이상 60글자 이내로 입력할 수 있습니다.\n\u203b 개인 정보 또는 사회적 규범을 위반하는 내용은 입력하지 말아주세요.\n\n■ 대표 우마무스메\n대표 우마무스메를 변경할 수 있습니다.\n설정된 대표 우마무스메는, 계승 우마무스메로 팔로워가 렌탈할 수 있습니다.\n\n■ 육성 서포트\n육성 서포트를 변경 할 수 있습니다.\n설정된 서포트 카드는 서포트 편성의 친구 서포트로 선택될 수 있습니다.\n\n■ 프로필 우마무스메 설정\n프로필 우마무스메를 변경할 수 있습니다.\nTP・RP 모두 회복했을 때 통지를 ON으로 할 경우, 프로필 우마무스메로부터 통지를 받을 수 있습니다.\n\n■ 트레이너 명함\n트레이너 명함을 편집할 수 있습니다.\n\u203b 트레이너 명함의 상세는 도움말 내부의 [트레이너 명함/서클 명함]에서 확인해 주세요.\n",
        "title": "프로필/트레이너 명함",
        "sort_id": 1
    },
    {
        "page_id": 3,
        "description": "[칭호]에서는, 칭호를 확인, 변경할 수 있습니다.\n또한, 칭호의 획득 조건도 확인 할 수 있습니다.\n\n■획득한 칭호의 확인 방법\n1. 홈의 [메뉴]를 탭합니다.\n2. [칭호]를 탭합니다.\n현재 소지한 칭호를 확인할 수 있습니다.\n\n■칭호의 변경\n1. 홈의 [메뉴]를 탭합니다.\n2. [칭호]를 탭합니다.\n3. 획득한 칭호 중에, 변경하고 싶은 칭호 아이콘을 탭합니다.\n4. [변경하기]로 칭호를 확정합니다.\n",
        "title": "칭호",
        "sort_id": 2
    },
    {
        "page_id": 4,
        "description": "[트로피 룸]에서는, GⅢ 이상 또는 특수한 레이스에서 획득한 트로피나, 통산 우승 횟수 등을 확인할 수 있습니다.\n\n■획득한 트로피의 확인 방법\n1. 홈의 [메뉴]를 탭합니다.\n2. [트로피 룸]을 탭합니다.\n현재 소지하고 있는 트로피를 확인할 수 있습니다.",
        "title": "트로피 룸",
        "sort_id": 3
    },
    {
        "page_id": 5,
        "description": "[친구]에서는, 팔로우와 팔로워를 확인할 수 있습니다.\n\n■친구의 확인 방법\n1. 홈의 [메뉴]를 탭합니다.\n2. [친구]를 탭합니다.\n\n■팔로우\n내가 팔로우한 트레이너를 확인할 수 있습니다.\n\n■팔로워\n나를 팔로우한 트레이너를 확인할 수 있습니다.\n\n■추천\n추천 트레이너가 표시됩니다.\n\u203b추천에서는, 자신과 우마무스메 도감의 Lv이 비슷한 트레이너가 표시됩니다.",
        "title": "친구",
        "sort_id": 4
    },
    {
        "page_id": 6,
        "description": "[구글 업적]에서는, 외부의 서비스를 이용해서 게임의 플레이 상황에 따른 업적을 확인할 수 있습니다.\n\n■실적을 확인\n1. 홈의 [메뉴]를 탭합니다.\n2. [구글 업적]을 탭합니다.\n\n\u203bAndroid(구글) 버전에서만 구글 업적을 이용할 수 있습니다.",
        "title": "구글 업적",
        "sort_id": 5
    },
    {
        "page_id": 7,
        "description": "[옵션]에서는, 게임의 설정을 변경할 수 있습니다.\n\n■설정의 변경 방법\n1. 홈의 [메뉴]를 탭 합니다.\n2. [옵션]을 탭 합니다.\n3. 기본 설정이나 사운드 등, 변경하고 싶은 설정의 탭을 탭 합니다.\n4. 변경하고 싶은 설정을 고릅니다.\n\n■기본 설정\n화면 설정이나 알림 등, 게임 전체에 관한 설정을 변경할 수 있습니다.\n\n\u203bAndroid 14에서 알림이 늦게 도착하는 경우 개선 방법에 대해\n\nAndroid 14 이상의 OS를 이용하는 경우, 앱 설치 직후에는 「알람 및 리마인더」 설정이 허가되어 있지 않기 때문에 알림이 통상보다 늦게 도착할 수 있습니다. 아래 순서로 진행하면, 더 정확한 알림을 받을 수 있습니다.\n\n1. 기기의 설정을 엽니다.\n2. [애플리케이션]을 선택합니다.\n3. [특별한 접근]에서 [알람 및 리마인더]를 선택합니다.\n4. [우마무스메]를 선택합니다.\n5. 「알람 및 리마인더」를 켭니다.\n\n해당 설정에 관해 궁금한 점이 있으시다면, 이용하는 휴대전화 회사나 기기 제조사에 문의해 주세요.\n\n・주의 사항\n1. 「알람 및 리마인더」를 켜도, 기기의 이용 상황에 따라 알림이 늦게 도착할 수 있습니다.\n2. 설정 순서는 기기에 따라 다를 수 있습니다.\n\n■육성\n육성 중 BGM 설정과 스킵 설정, 스킵 고속화 설정, 각종 확인 메시지의 표시를 변경할 수 있습니다.\n\n■사운드\nBGM이나 보이스 등 각종 음성의 음량의 조정을 할 수 있습니다.\n\n■육성\n육성 중 스킵 설정이나 각종 확인 메시지의 표시를 변경할 수 있습니다.\n\n■레이스\n레이스 중 스킬 컷인의 길이나, 중계 음성의 성별을 변경할 수 있습니다.\n\n■라이브\n라이브 연출이나 화면의 표시에 관한 설정을 변경할 수 있습니다.",
        "title": "옵션",
        "sort_id": 6
    },
    {
        "page_id": 8,
        "description": "[우마무스메 도감]에서는, 우마무스메에 관한 정보를 확인할 수 있습니다.\n\n■ 역대 평가 점수\n육성한 전당 입성 우마무스메의 역대 평가점을 확인할 수 있습니다.\n각 우마무스메 별로 모든 육성 시나리오 내 평가점이 높은 순으로 3개까지 기록되어, 평가점에 따라 도감Exp에 가산됩니다.\n또한, 시나리오 별 평가점도 평가점이 높은 순으로 3개까지 기록되나 도감Exp에는 가산되지 않으므로 참고 바랍니다.\n\n■ 트레이너 노트\n우마무스메의 프로필이나 앨범, 스토리 등을 확인할 수 있습니다.\n우마무스메의 친밀도 랭크를 높이면 해방되는 프로필도 있습니다.\n\n■ 도감 Lv\n역대 평가 점수에 등록된 전당 입성 우마무스메의 평가점이나 스토리 해방 수, 별명 획득 수 등이 도감 Exp에 가산됩니다.\n자세한 내용은 [상세]에서 확인할 수 있습니다.\n도감 Lv이 올라가면 보상을 획득할 수 있습니다.\n\n■ 육성 이벤트 갤러리\n육성에서 본 아래의 육성 이벤트를 다시 볼 수 있습니다.\n・육성 우마무스메 이벤트\n・서포트 카드 이벤트\n・메인 시나리오 이벤트\n\u203b 육성 우마무스메 이벤트, 서포트 카드 이벤트는,\n소지한 육성 우마무스메, 서포트 카드의 이벤트를 확인할 수 있습니다.\n\n■ 대화 갤러리\n홈에서 본 우마무스메들의 대화를 다시 볼 수 있습니다.\n\u203b 생일 대화는 홈에서 본 적이 없더라도 해당 우마무스메의 생일 이후에 로그인하면 대화 갤러리에 추가됩니다.\n\n■ 갤러리 키\n갤러리 키를 사용하면 육성 이벤트 갤러리나 대화 갤러리에서 미해방 육성 이벤트나 대화를 해방할 수 있습니다.\n\u203b 일부 메인 시나리오 이벤트는 육성 우마무스메를 소지해야 해방할 수 있습니다.\n\u203b 일부 육성 이벤트는 갤러리 키로 해방할 수 없습니다.\n\u203b 갤러리 키로 해방한 육성 이벤트는 옵션의 「첫 발생 이벤트도 스킵」을 OFF로 설정해도 스킵됩니다.\n\n갤러리 키는 주로 친구 Pt 교환에서 획득할 수 있습니다.",
        "title": "우마무스메 도감",
        "sort_id": 7
    },
    {
        "page_id": 9,
        "description": "[1컷 만화]에서는, 우마무스메들의 일상을 그린 1컷 만화를 볼 수 있습니다.\n\n■1컷 만화 보기\n1. 홈의 [메뉴]를 탭합니다.\n2. [1컷 만화]를 탭합니다.\n",
        "title": "1컷 만화",
        "sort_id": 8
    },
    {
        "page_id": 10,
        "description": "[비밀]에서는, 우마무스메들의 비밀을 볼 수 있습니다.\n\n■비밀 보기\n1. 홈의 [메뉴]를 탭합니다.\n2. [비밀]을 탭합니다.\n",
        "title": "비밀",
        "sort_id": 9
    },
    {
        "page_id": 11,
        "description": "[쥬얼 구입]에서는, 쥬얼을 구입할 수 있습니다.\n\n■구입 방법\n홈 상단의 쥬얼 부분의 [+]에서, 혹은 [메뉴]>[쥬얼 구입]에서 구입할 수 있습니다.\n\n■소지 가능한 쥬얼 상한 수\n무료 쥬얼 : 9,999,999\n유료 쥬얼 : 9,999,999\n\n■유료 쥬얼\n다른 플랫폼으로는 연동되지 않습니다.",
        "title": "쥬얼 구입",
        "sort_id": 10
    },
    {
        "page_id": 12,
        "description": "[계정 정보]에서는 게임회원번호 확인과 카카오 계정 연동 및 로그아웃, 구글 계정 연동 및 로그아웃, 게임 탈퇴를 진행할 수 있습니다.\n\n■ 카카오 계정 연동\n게스트 계정을 카카오 계정에 연동하면 현재 플레이하고 있는 기기와 다른 기기에서도 플레이할 수 있게 됩니다.\n또한 다른 플랫폼에서 플레이하더라도 유료 쥬얼, 무료 쥬얼을 모두 사용할 수 있게 됩니다.\n\n■ 카카오 계정 연동 방법\n1. 홈의 [메뉴]를 터치합니다.\n2. [계정 정보]를 터치합니다.\n3. [카카오 로그인]을 터치하면 게스트 계정을 카카오 계정에 연동하실 수 있습니다.\n\n■ 구글 플레이 계정 연동\n구글 플레이 계정 연동 시 Play Points를 적립하거나 업적을 달성할 수 있습니다.\n\u203b Android(구글) 버전에서만 구글 플레이 계정을 연동 및 로그인할 수 있습니다.\n\n■ 구글 플레이 계정 연동 방법\n1. 홈의 [메뉴]를 터치합니다.\n2. [계정 정보]를 터치합니다.\n3. [구글 플레이 로그인]을 터치하면 본인의 구글 계정으로 연동하실 수 있습니다.",
        "title": "계정 정보",
        "sort_id": 11
    },
    {
        "page_id": 13,
        "description": "[도움말・용어집]에서는 게임 내의 기능이나 용어의 확인을 할 수 있습니다.\n\n■ 도움말・용어집의 확인\n1. 홈의 [메뉴]를 탭합니다.\n2. [도움말・용어집]을 탭합니다.\n\n■ 도움말\n게임 내의 기능에 관한 설명을 확인할 수 있습니다.\n\n■ 용어집\n우마무스메 세계에 관한 용어나 경마에 관한 용어에 대해 확인할 수 있습니다.",
        "title": "도움말・용어집",
        "sort_id": 12
    },
    {
        "page_id": 14,
        "description": "[고객 센터]에서는 게임 중에 일어난 오류나 건의, 요청 등을 문의할 수 있습니다.\n이용 약관이나 개인정보처리방침 등도 이곳에서 확인할 수 있습니다.\n\n■ 이용 약관의 확인이나 문의에 대해\n1. 홈의 [메뉴]를 탭합니다.\n2. [고객 센터]를 탭합니다.",
        "title": "고객 센터",
        "sort_id": 13
    },
    {
        "page_id": 15,
        "description": "[타이틀로]에서는 타이틀로 돌아갈 수 있습니다.\n\n■ 타이틀로 돌아가는 방법\n1. 홈의 [메뉴]를 탭합니다.\n2. [타이틀로]를 탭합니다.",
        "title": "타이틀로",
        "sort_id": 14
    },
    {
        "page_id": 16,
        "description": "[의상 변경]에서는 이름이 같은 육성 우마무스메가 소지한 다른 의상으로 변경할 수 있습니다.\n의상은 해당 육성 우마무스메에 대응하는 전당 입성 우마무스메도 포함해 변경됩니다.\n\u203b스킬 컷인 등 일부 표시나 장면에서는 의상이 변경되지 않습니다.\n\u203b팀 경기장 등에서 다른 트레이너의 의상 변경은 반영되지 않습니다.\n\n■의상 변경 방법\n1. 홈 화면의 [메뉴]를 선택합니다.\n2. [의상 변경]을 선택합니다.\n3. 의상을 변경하고 싶은 육성 우마무스메를 선택하고 [의상 변경]을 선택합니다.\n4. 변경하고 싶은 의상을 선택하고 [의상 변경]을 선택합니다.",
        "title": "의상 변경",
        "sort_id": 15
    },
    {
        "page_id": 17,
        "description": "「포토」란 게임 안에서 화면 촬영이 가능한 기능입니다.\n[메뉴]>[옵션]>[기본 설정]에서 다음 사항을 [ON]으로 설정하면 이용할 수 있습니다.\n・촬영 버튼을 화면 위에 표시하기\n\n■포토 기능으로 할 수 있는 것\n・포토 촬영\n레이스, 라이브, 스토리, 포토 스튜디오, 산책 연출, 밸런타인 선물 연출의 각 기능으로 화면을 촬영합니다.\n\u203b라이브, 스토리는 가로 화면에서만 촬영할 수 있습니다.\n\u203b산책 연출은 「우마 산책 캠페인」 개최 중에만 확인, 촬영할 수 있습니다.\n\u203b밸런타인 선물 연출은 「밸런타인 캠페인」에서 특별한 초콜릿을 받을 때 확인, 촬영할 수 있습니다.\n또한 캠페인의 개최에 관계없이, [홈] > [메뉴] > [도감] > [트레이너 노트]에서 우마무스메를 선택 후, [연출] > [기타]의 탭에서 해방 완료 밸런타인 선물 연출을 확인, 촬영할 수 있습니다.\n\n・포토 편집\n촬영한 포토에 필터를 씌웁니다.\n\n포토에 씌울 수 있는 필터의 종류는 다음과 같습니다.\n\n・오리지널(촬영한 화면을 그대로 저장합니다.)\n・실버\n・드라마\n・샤프\n・걸리\n・레트로\n・쿨\n・큐트\n・세피아\n・모노크롬\n\n또한 저장 화면 안에 있는 [UI 비표시]를 누르면 포토에 표시된 버튼 등의 UI를 표시하지 않습니다.\n\u203b포토 스튜디오에서 촬영한 포토는 UI가 표시되지 않습니다.\n\n・포토 저장\n포토 촬영 후, 저장된 포토를 포토 라이브러리에서 확인할 수 있습니다.\n\n포토 라이브러리는 아래 방법으로 확인할 수 있습니다.\n・포토 저장 화면 안에 있는 [포토 라이브러리]\n・[홈]>[메뉴]>[포토 라이브러리]\n\n\u203b저장할 수 있는 포토 수는 최대 120장입니다.",
        "title": "포토란",
        "sort_id": 16
    },
    {
        "page_id": 18,
        "description": "포토 촬영은 다음과 같은 순서로 진행됩니다.\n\n1. 기능 설정\n[메뉴]>[옵션]>[기본 설정]에서 [촬영 버튼을 화면 위에 표시하기]를 [ON]으로 설정합니다.\n\n2. 촬영 버튼을 누른다\n레이스, 라이브, 스토리, 포토 스튜디오, 산책 연출, 밸런타인 선물 연출의 각 기능 이용 중 촬영 버튼이 표시됩니다.\n원하는 화면에서 촬영 버튼을 눌러 촬영합니다.\n촬영 버튼을 누르면 포토 저장 화면으로 이동합니다.\n\u203b라이브, 스토리는 가로 화면에서만 촬영할 수 있습니다.\n\n3. 포토 편집\n포토 저장 화면에서 포토를 편집할 수 있습니다.\n\n4. 포토 저장\n포토 저장 화면에서 [저장]을 누르면 포토를 저장할 수 있습니다.\n\n■저장된 포토에 관한 주의사항\n포토를 120장 저장한 상태로 새로운 포토를 저장한 경우, 즐겨찾기나 사용 중이 아닌 저장 날짜가 오래된 포토부터 덮어씌워 저장됩니다.\n\n포토 저장 화면 안에서 [저장]을 누를 때 아래의 2가지 조건에 해당하는 경우에는 「오리지널 포토」와 「필터를 씌운 포토」, 총 2장이 포토 라이브러리에 저장됩니다.\n・촬영한 포토의 저장이 첫 번째인 경우\n・필터를 씌운 포토를 저장한 경우\n\u203b저장된 포토는 편집할 수 없습니다.\n\n포토 저장 화면에서 다음과 같은 일이 발생한 경우, 포토를 저장할 수 없습니다.\n・앱 강제 종료 등 게임을 강제 종료한다\n\n또한 포토 저장 화면에서 다음과 같은 일이 발생한 경우, 포토를 저장할 수 없는 경우가 있습니다.\n・날짜의 변경",
        "title": "포토 촬영 순서",
        "sort_id": 17
    },
    {
        "page_id": 19,
        "description": "「포토 라이브러리」란 포토 기능을 사용해 촬영한 스크린을 목록으로 표시하는 기능입니다.\n\n포토 라이브러리는 다음 방법으로 볼 수 있습니다.\n・포토 저장 화면 내부의 [포토 라이브러리]\n・[홈]>[메뉴]에서 이동할 수 있는 [포토 라이브러리]\n\n■포토 라이브러리로 할 수 있는 것\n・저장한 포토 확인\n・저장한 포토의 즐겨찾기 설정\n\u203b즐겨찾기 설정이 가능한 포토는 최대 30장입니다.\n・저장한 포토의 삭제\n\u203b삭제한 포토는 복구할 수 없습니다.\n\n주의사항\n\u203b데이터를 연동해 사용하는 기기를 변경한 경우 저장한 포토는 연동되지 않습니다.\n・유저 데이터 삭제를 하면 저장한 포토는 삭제됩니다.",
        "title": "포토 라이브러리",
        "sort_id": 18
    },
    {
        "page_id": 20,
        "description": "「트레이너 명함」을 만들면 게임 안의 상황을 정리한 이미지를 기기에 저장할 수 있습니다.\n또한 만든 명함을 SNS에 공유할 수 있습니다.\n\n■트레이너 명함 작성 방법\n1. 홈 화면의 오른쪽 상단 [메뉴]를 선택합니다.\n2. [프로필/트레이너 명함]을 선택합니다.\n3. 프로필 화면의 [트레이너 명함]을 선택하면 트레이너 명함 화면으로 이동합니다.\n4. 트레이너 명함 화면의 [명함 편집]을 선택해 명함 편집 화면을 엽니다.\n5. 베이스 디자인, 일러스트, 트레이너 정보를 편집하고 [저장]을 선택하면 트레이너 명함이 저장됩니다.\n\n저장된 명함의 일러스트는 사용하는 기기를 변경한 경우에도 연동됩니다.\n\u203b연동된 일러스트는 재편집할 수 없습니다.\n\n■설정 중인 트레이너 명함 확대 표시\n트레이너 명함 화면에 있는 명함 이미지를 탭하면 설정 중인 트레이너 명함 이미지를 확대해서 표시합니다.\n\u203b PC 버전에서는 설정 중인 트레이너 명함의 앞 면 혹은 뒷 면 이미지를 선택해도 확대하여 표시되지 않습니다.\n\n■SNS에 공유, 기기 저장 방법\n트레이너 명함 화면의 [SNS 공유]를 선택하면 만든 트레이너 명함 이미지에 코멘트를 첨부해 SNS에 공유할 수 있습니다.\n\u203b PC 버전에서는 SNS로 공유할 수 없습니다.\n\n또한 트레이너 명함 화면의 [기기에 저장]을 선택하면 만든 트레이너 명함을 이용하는 단말기에 저장할 수 있습니다.",
        "title": "트레이너 명함이란?",
        "sort_id": 19
    },
    {
        "page_id": 21,
        "description": "트레이너 명함의 편집 화면에서는 다음과 같은 내용을 편집할 수 있습니다.\n\n■뒷면에 인자 정보 표시하기\n위의 항목을 ON으로 설정하면 명함 화면에 대표 우마무스메가 소지한 인자의 정보를 표시할 수 있습니다.\n또한 ON으로 설정한 경우에만 명함 편집 화면에서 [뒷면]을 선택하면 뒷면 내용을 확인할 수 있습니다.\n\n■베이스 디자인 편집\n트레이너 명함의 베이스 디자인과 관련된 항목을 편집할 수 있습니다.\n・일러스트 배치\n일러스트의 표시 영역을 좌, 우 중에 선택할 수 있습니다.\n\n・테마 컬러\n트레이너 명함에 사용하는 테마 컬러를 선택할 수 있습니다.\n\n・명함 배경\n트레이너 명함의 배경을 선택할 수 있습니다.\n\n■일러스트 편집\n명함에 실리는 일러스트를 선택해 편집할 수 있습니다.\n일러스트로 선택할 수 있는 것은 다음의 3가지입니다.\n・육성 우마무스메\n・서포트 카드\n・포토\n\n■트레이너 정보\n명함에 실리는 트레이너 정보를 편집할 수 있습니다.\n・칭호\n소지한 칭호에서 하나를 선택해 표시할 수 있습니다.\n프로필에 설정한 것과 같은 칭호가 표시됩니다.\n\u203b트레이너 명함에서 칭호를 변경하면 프로필의 칭호도 변경됩니다.\n\n・대표 우마무스메/육성 서포트\n대표 우마무스메와 육성 서포트를 설정할 수 있습니다.\n프로필에서 설정한 것과 같은 대표 우마무스메, 육성 서포트가 표시됩니다.\n\u203b트레이너 명함에서 대표 우마무스메, 육성 서포트를 변경하면 프로필의 대표 우마무스메, 육성 서포트도 변경됩니다.\n\n■코멘트\n명함에 실리는 코멘트를 편집할 수 있습니다.\n코멘트는 최대 57글자까지 입력할 수 있습니다.\n\u203b코멘트를 편집할 때 입력된 줄 바꿈은 반영되지 않습니다.\n\n[원래대로 되돌리기]를 선택하면 모든 내용이 편집을 시작할 때 상태로 돌아갑니다.\n각 내용을 편집한 후, [저장]을 선택하면 편집한 내용이 트레이너 명함 화면에 반영됩니다.\n\n■트레이너 ID 표시\n위의 항목을 OFF로 설정하면 트레이너 명함에 트레이너 ID가 표시되지 않습니다.",
        "title": "트레이너 명함 편집",
        "sort_id": 20
    },
    {
        "page_id": 22,
        "description": "일러스트 편집에서 [육성 우마무스메]를 선택하면 소지한 육성 우마무스메와 배경을 지정해 표시할 수 있습니다.\n\n■일러스트 편집에서 [육성 우마무스메]를 선택했을 때 할 수 있는 것\n・[육성 우마무스메] 선택\n표시하고 싶은 육성 우마무스메를 리스트에서 선택할 수 있습니다.\n\n・의상 선택\n선택 중인 육성 우마무스메가 소지한 의상을 리스트에서 선택할 수 있습니다.\n\n・배경 선택\n선택한 육성 우마무스메의 배경에 표시할 내용을 리스트에서 선택할 수 있습니다.",
        "title": "일러스트 편집(육성 우마무스메)",
        "sort_id": 21
    },
    {
        "page_id": 23,
        "description": "일러스트 편집에서 [서포트 카드]를 선택하면 소지한 서포트 카드에서 1장을 선택할 수 있습니다.\n선택한 서포트 카드를 편집하고 명함에 표시할 수 있습니다.\n\n일러스트 편집에서 [포토]를 선택하면 소지한 포토 중에서 1장을 선택할 수 있습니다.\n선택한 포토를 편집하고 명함에 표시할 수 있습니다.\n\n■일러스트 편집에서 [서포트 카드], [포토]를 선택했을 때 할 수 있는 것\n・[서포트 카드], [포토]의 편집\n소지한 서포트 카드나 포토를 1장 선택해 편집할 수 있습니다.\n\n・ 서포트 카드, 포토의 확대 축소 중앙 위치 조절\n\n화면 윗부분에 표시된 서포트 카드, 포토의 옆에 있는 [편집]을 선택하면 선택 중인 이미지가 편집 상태가 됩니다.\n편집 상태에서는 다음과 같은 편집을 실시할 수 있습니다.\n・핀치 인, 핀치 아웃 해서 확대, 축소한다\n・두 지점을 선택해 회전한다\n・드래그해서 중앙 위치를 조절한다\n\n또한 편집 상태일 때만 표시되는 [이동], [확대 축소], [회전]을 ON 또는 OFF로 설정하면 조작을 제한할 수 있습니다.\n\u203bON 상태인 것만 조작합니다.\n\u203b[회전]은 디폴트가 OFF입니다.\n\n조작한 내용을 원래대로 돌리고 싶으면 [리셋]을 선택해 주세요.\n\n편집 상태가 되면 선택 중인 이미지의 주변에 네모난 범위가 표시됩니다.\n네모난 범위의 옆에 표시되는 [회전], [확대 축소]를 조작해 회전과 확대 축소를, 이미지 중앙을 드래그해 중앙 위치를 조절할 수 있습니다.",
        "title": "일러스트 편집(서포트 카드, 포토)",
        "sort_id": 22
    },
    {
        "page_id": 24,
        "description": "「포토 스튜디오」란 육성 중의 트레이닝이나 외출 연출을 자유롭게 재현해 포토 촬영을 할 수 있는 기능입니다.\n포토 스튜디오에서 복장이 다른 우마무스메를 촬영할 때는, 승부복 착용 시에만 머리 스타일이나 머리 장식이 변경됩니다.\n의상 변경은 반영되지 않습니다.\n\n■촬영 우마무스메 선택\n소지한 육성 우마무스메 중에서 촬영할 우마무스메를 선택할 수 있습니다.\n\n■촬영 파트 선택\n촬영하고 싶은 장면을 「트레이닝」 혹은 「외출・이벤트」에서 선택합니다.\n\n■트레이닝 상세\n촬영하고 싶은 트레이닝 상세를 설정할 수 있습니다.\n\u203b설정할 수 있는 항목은 트레이닝 카테고리에 따라 다릅니다.\n\n■외출・이벤트\n촬영하고 싶은 외출 장소 및 계절을 설정할 수 있습니다.\n설정할 수 있는 외출 장소는 아래와 같습니다.\n\n・하천 부지\n・신사\n・노래방\n・바다\n・파리 관광\n・온천 여행\n\n\u203b계절은 외출 장소에 따라 고정되는 경우가 있습니다.\n\u203b신사의 운세 뽑기 결과는 랜덤입니다.\n\u203b온천 여행은 육성 이벤트 「온천 여행」을 관람 완료한 우마무스메를 촬영 우마무스메로 설정한 경우에만 설정할 수 있습니다.\n\n■촬영 화면\n촬영 화면에서는 화면에 임의의 장소를 선택하면 연출의 일시 정지와 재생을 할 수 있습니다.\n루프를 「ON」으로 설정하면 같은 연출을 반복 재생할 수 있습니다.\n[촬영]을 선택하면 포토 촬영을 할 수 있습니다.\n\n\u203b포토 스튜디오에서 촬영한 포토는 UI가 표시되지 않습니다.\n\n■루프에 관해\n루프 설정은 저장됩니다.\n촬영 때마다 리셋되지 않습니다.\n\n■사운드에 관해\n[촬영 시작!] 선택 후 연출이 재생되는 동안 BGM이나 보이스 등 각종 음성 상태는 다음과 같습니다.\n・보이스: 있음\n・효과음: 있음\n・BGM: 없음\n\u203b보이스는 [촬영 시작!]을 선택 후, 처음에만 재생됩니다.\n",
        "title": "포토 스튜디오",
        "sort_id": 23
    },
    {
        "page_id": 25,
        "description": "「트레이너 명함」을 만들면 게임 내 상황을 정리한 이미지를 기기에 저장할 수 있습니다.\n「서클 명함」을 만들면 서클 랭킹과 서클 정보를 정리한 이미지를 기기에 저장할 수 있습니다.\n\u203b 서클 리더만 명함 편집을 할 수 있습니다.\n또한 만든 명함을 SNS에 공유할 수 있습니다.\n\n■ 트레이너 명함 작성 방법\n1. 홈 화면의 오른쪽 상단 [메뉴]를 선택합니다.\n2. [프로필/트레이너 명함]을 선택합니다.\n3. 프로필 화면의 [트레이너 명함]을 선택하면 트레이너 명함 화면으로 이동합니다.\n4. 트레이너 명함 화면의 [명함 편집]을 선택해 명함 편집 화면을 엽니다.\n5. 베이스 디자인, 일러스트, 트레이너 정보를 편집하고 [저장]을 선택하면 트레이너 명함이 저장됩니다.\n\n■ 서클 명함 작성 방법\n1.홈 화면의 [서클]을 선택합니다.\n2. [서클 메뉴]를 선택합니다.\n3. [서클 명함]을 선택하면 서클 명함 화면으로 이동합니다.\n4. 서클 명함 화면의 [명함 편집]을 선택해 명함 편집 화면을 엽니다.\n5. 베이스 디자인, 일러스트, 서클 정보를 편집하고 [저장]을 선택하면 서클 명함이 저장됩니다.\n\n저장된 명함의 일러스트는 사용하는 기기를 변경한 경우에도 연동됩니다.\n\u203b 연동된 일러스트는 재편집할 수 없습니다.\n\n■ 설정 중인 명함 확대 표시\n트레이너 명함, 서클 명함 화면에 있는 명함 이미지를 선택하면 설정 중인 명함 이미지를 확대해서 표시할 수 있습니다.\n\n■ SNS에 공유, 기기 저장 방법\n트레이너 명함, 서클 명함 화면의 [SNS 공유]를 선택하면 만든 명함 이미지에 코멘트를 첨부해 SNS에 공유할 수 있습니다.\n\n또한 트레이너 명함, 서클 명함 화면의 [기기에 저장]을 선택하면 만든 명함을 이용하는 기기에 저장할 수 있습니다.\n",
        "title": "트레이너 명함/서클 명함이란",
        "sort_id": 24
    },
    {
        "page_id": 26,
        "description": "서클 명함의 편집 화면에서는 다음과 같은 내용을 편집할 수 있습니다.\n\u203b 서클 리더만 서클 명함을 편집할 수 있습니다.\n\n■ 베이스 디자인 편집\n서클 명함의 베이스 디자인과 관련된 항목을 편집할 수 있습니다.\n・일러스트 배치\n일러스트를 표시할 영역을 좌, 우 중에서 선택할 수 있습니다.\n\n・테마 컬러\n서클 명함에 사용할 테마 컬러를 선택할 수 있습니다.\n\n・명함 배경\n서클 명함의 배경을 선택할 수 있습니다.\n\n■ 일러스트 편집\n명함에 실을 일러스트를 선택해 편집할 수 있습니다.\n일러스트로 선택할 수 있는 것은 다음의 3가지입니다.\n・육성 우마무스메\n・서포트 카드\n・포토\n\n■ 서클 정보\n명함에 실을 서클 정보를 편집할 수 있습니다.\n\u203b 서클 명함에서 서클명, 가입 방침, 활동 방침, 소개문을 변경하면 서클의 서클명, 가입 방침, 활동 방침, 소개문도 변경됩니다.\n\n■ 코멘트\n명함에 실을 코멘트를 편집할 수 있습니다.\n코멘트는 최대 40글자까지 입력할 수 있습니다.\n\u203b 코멘트를 편집할 때 입력된 줄 바꿈은 반영되지 않습니다.\n\n[원래대로 되돌리기]를 선택하면 모든 내용이 편집하기 전 상태로 돌아갑니다.\n각 내용을 편집한 후, [저장]을 선택하면 편집한 내용이 서클 명함 화면에 반영됩니다.",
        "title": "서클 명함 편집",
        "sort_id": 25
    },
    {
        "page_id": 27,
        "description": "[트레이닝 패스]에서는 정해진 집계 기간 내에 육성에서 획득한 트레이닝 성과에 따라 보상을 획득할 수 있습니다.\n\n■트레이닝 성과\n육성 중에 트레이닝이나 이벤트로 기초 능력이나 스킬 Pt를 획득하면, 그 획득량에 따라 트레이닝 성과를 획득할 수 있습니다.\n또한, 육성을 완료하면 전당 입성 우마무스메의 기초 능력에 따라 트레이닝 성과를 획득할 수 있습니다.\n트레이닝 효과가 특정 Pt까지 도달하면, 해당 Pt에 따른 보상을 획득할 수 있습니다.\n보상 획득에 필요한 트레이닝 성과 Pt는 보상 및 집계 기간별로 달라질 수 있습니다.\n\n■집계 기간\n트레이닝 패스에는 집계 기간이 정해져 있습니다.\n집계 기간이 끝나면 새로 집계 기간이 시작되며, 트레이닝 성과와 보상 획득 상황은 리셋됩니다.\n집계 기간은 기간별로 달라질 수 있습니다.\n\n■프리미엄 패스\n집계 기간 중에 프리미엄 패스를 구매하면, 트레이닝 패스에서 획득할 수 있는 보상에 더해, 프리미엄 패스 전용 보상을 획득할 수 있게 됩니다.\n프리미엄 패스 전용 보상은 프리미엄 패스를 구매하고, 그 보상에 필요한 트레이닝 성과 Pt에 도달하면 획득할 수 있습니다.\n프리미엄 패스는 집계 기간별로 1회만 구매할 수 있으며, 집계 기간이 끝나면 구매 상태가 리셋됩니다.\n프리미엄 패스는 집계 기간 종료 7시간 전까지 구매할 수 있습니다.\n자세한 내용은 프리미엄 패스의 상품 상세를 확인해 주세요.",
        "title": "트레이닝 패스",
        "sort_id": 26
    }
];

for (let page of orignal) {
    const found = newlist.find((npage) => npage.title === page.title);

    if (found) {
        page.description = found.description;
    }
}

require('child_process').spawn('clip').stdin.end(JSON.stringify(orignal, null, 4))